database.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>データベースのことで調べたこと考えたことをずらずらと</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="データベースのことで調べたこと考えたことをずらずらと"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-15 21:12:35 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="./org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">データベースのことで調べたこと考えたことをずらずらと</h1>


<meta content='no-cache' http-equiv='Pragma' />

    <div class='navbar navbar-fixed-top'>
      <div class='navbar-inner'>
        <div class='container'>
          <a class='brand' href='/memo/index.html'>トップに戻る</a>
          <ul class='nav'>
            <li>
              <a href='#sec-1'>MySQL</a>
            </li>
            <li>
              <a href='#sec-2'>MongoDB</a>
            </li>
          </ul>
        </div>
      </div>
    </div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 MySQL</a>
<ul>
<li><a href="#sec-1-1">1.1 資料</a></li>
<li><a href="#sec-1-2">1.2 主にMySQLのことを調べて，使い方を書く</a></li>
<li><a href="#sec-1-3">1.3 ユーザの管理</a></li>
<li><a href="#sec-1-4">1.4 RubyからMySQLとかに繋ぐ場合</a></li>
<li><a href="#sec-1-5">1.5 エラーログの場所</a></li>
<li><a href="#sec-1-6">1.6 テスト環境はMac，本番環境はOpenSUSE</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 OpenSUSEでMySQLが動かない．．．</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 MySQLのインストール</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 Ubuntuで</a></li>
<li><a href="#sec-1-7-2">1.7.2 Linux Mintにて</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 mongoDBのこと</a>
<ul>
<li><a href="#sec-2-1">2.1 mongoDB導入編</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Linux Mint</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 RubyからmongoDBを使うには</a></li>
<li><a href="#sec-2-3">2.3 mongoDBのデータのバックアップとリストア</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> MySQL</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 資料</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>Link
<ul>
<li>libmysqlclientを使うプログラムはset namesをutf8であっても使ってはいけない <a href="http://blog.everqueue.com/chiba/2009/02/05/129/">http://blog.everqueue.com/chiba/2009/02/05/129/</a>
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 主にMySQLのことを調べて，使い方を書く</h3>
<div class="outline-text-3" id="text-1-2">


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> ユーザの管理</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>ユーザの表示
</li>
</ul>




<pre class="example">select User, Host FROM mysql.user;
</pre>

<ul>
<li>追加
</li>
</ul>




<pre class="example">create database hoge;
GRANT ALL on hoge.* to yuuhi@localhost;
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> RubyからMySQLとかに繋ぐ場合</h3>
<div class="outline-text-3" id="text-1-4">




<pre class="example">gem install mysql
</pre>

<p>
でおきる問題．
</p>


<pre class="example">sudo aptitude install libmysqlclient-dev
sudo aptitude install libmysql-ruby
</pre>

<p>
で
</p>


<pre class="example">gem install mysql
</pre>



<pre class="example"># データベース統一インターフェース
gem install dbi
gem install dbd-mysql
gem install dbd-pg
gem install dbd-sqlite3
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> エラーログの場所</h3>
<div class="outline-text-3" id="text-1-5">




<pre class="example">~/log/mysql/error-log.err
</pre>

<p>
にある
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> テスト環境はMac，本番環境はOpenSUSE</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> OpenSUSEでMySQLが動かない．．．</h4>
<div class="outline-text-4" id="text-1-6-1">




<pre class="example">&gt; rcmysql start
cat: /etc/my.cnf: Permission denied
chown: changing ownership of `/var/run/mysql': Operation not permitted
cat: /etc/my.cnf: Permission denied
chown: changing ownership of `/var/run/mysql': Operation not permitted
tee: /var/run/mysql/tmpdir: Permission denied
chown: changing ownership of `/var/tmp/mysql.KNAGa3': Operation not permitted
Can't create secure /var/tmp/mysql.KNAGa3
</pre>

<p>
こんな感じで．
</p>


<pre class="example">&gt; mysqld       
120430  4:26:02 [Warning] Can't create test file /var/lib/mysql/linux-z5ho.lower-test
120430  4:26:02 [Warning] Can't create test file /var/lib/mysql/linux-z5ho.lower-test
120430  4:26:02 [Note] Plugin 'ndbcluster' is disabled.
120430  4:26:02 [ERROR] mysqld: Can't find file: './mysql/plugin.frm' (errno: 13)
120430  4:26:02 [ERROR] Can't open the mysql.plugin table. Please run mysql_upgrade to create it.
120430  4:26:02 [ERROR] mysqld: File '/var/lib/mysql/maria_log_control' not found (Errcode: 13)
120430  4:26:02 [ERROR] mysqld: Got error 'Can't open file' when trying to use maria control file '/var/lib/mysql/maria_log_control'
120430  4:26:02 [ERROR] Plugin 'MARIA' init function returned error.
120430  4:26:02 [ERROR] Plugin 'MARIA' registration as a STORAGE ENGINE failed.
InnoDB: The InnoDB memory heap is disabled
InnoDB: Mutexes and rw_locks use GCC atomic builtins
InnoDB: Compressed tables use zlib 1.2.5
120430  4:26:02  InnoDB: Initializing buffer pool, size = 128.0M
120430  4:26:02  InnoDB: Completed initialization of buffer pool
120430  4:26:02  InnoDB: Operating system error number 13 in a file operation.
InnoDB: The error means mysqld does not have the access rights to
InnoDB: the directory.
InnoDB: File name ./ibdata1
InnoDB: File operation call: 'create'.
InnoDB: Cannot continue operation.
</pre>


<pre class="example">&gt; mysqld_safe
120430 04:26:48 mysqld_safe Logging to '/var/lib/mysql/linux-z5ho.err'.
120430 04:26:48 mysqld_safe Starting mysqld daemon with databases from /var/lib/mysql
/usr/bin/mysqld_safe: line 101: /var/lib/mysql/linux-z5ho.err: Permission denied
/usr/bin/mysqld_safe: line 138: /var/lib/mysql/linux-z5ho.err: Permission denied
120430 04:26:48 mysqld_safe mysqld from pid file /var/lib/mysql/linux-z5ho.pid ended
/usr/bin/mysqld_safe: line 101: /var/lib/mysql/linux-z5ho.err: Permission denied
</pre>


<p>
こちらの知識不足もあるのだろうけど，もうOpenSUSEでの運用やめようかと．．<br/>
-&gt; 最後にソースからMySQLインストールしてみて決める
</p>
</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> MySQLのインストール</h3>
<div class="outline-text-3" id="text-1-7">

<ul>
<li>たしか，homebrewでインストールした．
</li>
<li><a href="http://d.hatena.ne.jp/okboy/20101120/p1">http://d.hatena.ne.jp/okboy/20101120/p1</a>
</li>
</ul>




<pre class="example">% brew install mongodb
</pre>



<pre class="example">% mysqld
% mysql -u root -p
mysql&gt; SELECT User, Host FROM mysql.user;
mysql&gt; create database twitterDB;
mysql&gt; GRANT ALL ON twitterDB.* to yuuhi@localhost IDENTIFIED BY 'passwd';
Query OK, ..........

mysql&gt; mysqld_safe --log-error=$HOME/log/mysql/error-log
mysql&gt; mysql.server stop
</pre>



</div>

<div id="outline-container-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> Ubuntuで</h4>
<div class="outline-text-4" id="text-1-7-1">




<pre class="example">% sudo apt-get install mysql-server
% sudo service mysql start
</pre>


</div>

</div>

<div id="outline-container-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> Linux Mintにて</h4>
<div class="outline-text-4" id="text-1-7-2">




<pre class="example">default-character-set=utf8
skip-character-set-client-handshake
</pre>

<p>
がないと動かない
</p>
<ul>
<li>下記のようにmy.cnfに追加
</li>
</ul>




<pre class="example">[client]
default-character-set = utf8

[mysqld]
character-set-server = utf8
skip-character-set-client-handshake

[mysqldump]
default-character-set = utf8

[mysql]
default-character-set = utf8
</pre>



<pre class="example">% sudo /etc/init.d/mysql restart
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> mongoDBのこと</h2>
<div class="outline-text-2" id="text-2">

<p><a href="http://www.mongodb.org/">http://www.mongodb.org/</a>
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> mongoDB導入編</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Linux Mint</h4>
<div class="outline-text-4" id="text-2-1-1">




<pre class="example">sudo aptitude install mongodb
</pre>

<ul>
<li>aptでインストールするとかってにデーモンまで起動してくれる
  <a href="http://ubuntuforums.org/showthread.php?t=1715866">http://ubuntuforums.org/showthread.php?t=1715866</a>



<pre class="example">ps -eF | grep 'mongo\|PIDThi
</pre>

<ul>
<li>MySQLと同じく
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> RubyからmongoDBを使うには</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="example">gem install mongo bson_ext
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> mongoDBのデータのバックアップとリストア</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li><a href="http://conol.co.jp/blog/archives/253">http://conol.co.jp/blog/archives/253</a>



<pre class="example">//BSONファイルでデータを出力する
mongodump -d &lt;DatabaseName&gt; -u &lt;username&gt; -p &lt;password&gt;
//BSONファイルからデータをリストアする（全データ先に削除）
mongorestore -d &lt;DatabaseName&gt; -u &lt;username&gt; -p &lt;password&gt; --drop &lt;BackupDataPath&gt;
</pre>


</li>
<li>JSON形式でバックアップを取りたい場合には



<pre class="example">//Jsonファイルにて特定コレクションを出力する
mongoexport -d &lt;DatabaseName&gt; -c &lt;CollectionName&gt; -u &lt;username&gt; -p &lt;password&gt; -o &lt;fileName&gt;.json
//Jsonファイルから特定コレクションみのデータを更新する
mongoimport -d &lt;DatabaseName&gt; -c &lt;CollectionName&gt; -u &lt;username&gt; -p &lt;password&gt; &lt;fileName&gt;.json --upsert
//Jsonファイルから特定コレクションの指定フィールドのみのデータを更新する
mongoimport -d &lt;DatabaseName&gt; -c &lt;CollectionName&gt; -f image -u &lt;username&gt; -p &lt;password&gt; &lt;fileName&gt;.json --upsert
</pre>

</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-05-15 21:12:35 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
